<?php
//Арты для параметров юнитов
//0.0-Сердце воина - +10 к жизням пехотинцев, кавалерии и стрелков
//0.1-Стальная подкова - +10 к параметрам кавалерии
//0.2-Стальная стрела - +10 к параметрам стрелков
//0.3-Чугунное ядро - + 10 к параметрам пушек
//0.4-Динамит - +10 к параметрам подрывников
//0.5-Обтекаемое крыло - +10 к параметрам самолетов
//0.6-Техническое волшебство - увеличение коэфф магов против техники в 20 раз
//Генеральские арты
//1.0-Учебник генерала - +200 навыка
//1.1-Медаль за храбрость - +30 морали
//1.2-Погон генеральский - +1..5 морали за крупную битву (больше 5000 опыта)

$arts=array();



//Артефакты для параметров юнитов
$artarmy=array(

//***************************************************************************
//0.0-Сердце воина - +10 к жизням пехотинцев, кавалерии и стрелков
//***************************************************************************
array(10,'Артефакт <u>Сердце воина</u> прибавляет к жизням пехотинцев, кавалерии и срелков <b>10</b> жизней!'),

//***************************************************************************
//0.1-Стальная подкова - +10 к параметрам кавалерии
//***************************************************************************
array(10,'Артефакт <u>Стальная подкова</u> увеличивает параметры кавалерии на <b>10</b>!'),

//***************************************************************************
//0.2-Стальная стрела - +10 к параметрам стрелков
//***************************************************************************
array(10,'Артефакт <u>Стальная стрела</u> увеличивает параметры стрелков на <b>10</b>!'),

//***************************************************************************
//0.3-Чугунное ядро - + 10 к параметрам пушек
//***************************************************************************
array(10,'Артефакт <u>Чугунное ядро</u> увеличивает параметры пушек на <b>10</b>!'),

//***************************************************************************
//0.4-Динамит - +10 к параметрам подрывников
//***************************************************************************
array(10,'Артефакт <u>Динамит</u> увеличивает параметры подрывников на <b>10</b>!'),

//***************************************************************************
//0.5-Обтекаемое крыло - +10 к параметрам самолетов
//***************************************************************************
array(10,'Артефакт <u>Обтекаемое крыло</u> увеличивает параметры самолётов на <b>10</b>!'),

//***************************************************************************
//0.6-Техническое волшебство - увеличение коэфф магов против техники в 20 раз
//***************************************************************************
array(20,'Артефакт <u>Техническое волшебство</u> увеличивает кофицент магов против техники в <b>20</b> раз!'));


array_push($arts,$artarmy);




//Артефакты для генерала
$artgeneral=array(

//***************************************************************************
//1.0-Учебник генерала - +200 навыка
//***************************************************************************
array(200,'Артефакт <u>Учебник генерала</u> увеличивает навык Вашего генерала на <b>200</b>!'),

//***************************************************************************
//1.1-Медаль за храбрость - +30 морали
//***************************************************************************
array(30,'Артефакт <u>Медаль за храбрость</u> увеличивает мораль Вашего генерала на <b>30</b>!'),

//***************************************************************************
//1.2-Погон генеральский - +1..5 морали за крупную битву (больше 5000 опыта)
//***************************************************************************
array(RAND(1,5),'Артефакт <u>Генеральский погон</u> увеличивает мораль Вашего генерала на <b>1</b>-<b>5</b> случайным образом при каждой битве крупнее <b>5000</b> опыта!')  );


array_push($arts,$artgeneral);
?>