<?

//==============================================================================

/*
Ќад одним зданием может работать определенный максимум
рабочих, напр€мую завис€щий от пространства, которое
занимает данное строение. “.е. на одой единице земли
может работать только установленное число рабочих:
*/
$workers_max=5;
/*
—корость работы рабочих над зданием зависит от характеристик
постройки. «ависимость определ€етс€ следующей функцией worktime()
(определена в func/game_func.php)
*/

//******************************************************************************
//казармы***********************************************************************
$barracks_arbor=100;
$barracks_stone=130;
$barracks_iron=50;
$barracks_land=40;
$barracks_time=432000;
$barracks_kill=30;

//******************************************************************************
//ƒом войны*********************************************************************
$warhouse_arbor=30;
$warhouse_stone=70;
$warhouse_iron=40;
$warhouse_land=40;
$warhouse_time=216000;
$warhouse_money=2000;
$warhouse_kill=50;

//******************************************************************************
//ратуша************************************************************************
$ratusha_arbor=50;
$ratusha_stone=110;
$ratusha_iron=50;
$ratusha_land=60;
$ratusha_time=576000;
$ratusha__kill=45;

//******************************************************************************
//цитадель**********************************************************************
$citadel_arbor=30;
$citadel_stone=80;
$citadel_iron=60;
$citadel_land=60;
$citadel_time=576000;
$citadel_money=2200;
$citadel_kill=65;

//******************************************************************************
//университет*******************************************************************
$university_arbor=50;
$university_stone=70;
$university_iron=20;
$university_land=30;
$university_time=432000;
$university_kill=30;

//******************************************************************************
//научный центр*****************************************************************
$scientificcenter_arbor=20;
$scientificcenter_stone=50;
$scientificcenter_iron=20;
$scientificcenter_land=30;
$scientificcenter_time=216000;
$scientificcenter_money=2000;
$scientificcenter_kill=40;

//******************************************************************************
//д€рЄвн€***********************************************************************
$village_arbor=150;
$village_stone=20;
$village_iron=10;
$village_land=100;
$village_time=144000;
$village_kill=25;

//******************************************************************************
//хранилисче********************************************************************
$keeping_arbor=50;
$keeping_stone=80;
$keeping_iron=0;
$keeping_land=150;
$keeping_time=180000;
$keeping_kill=15;

//******************************************************************************
//рынок*************************************************************************
$market_arbor=70;
$market_stone=50;
$market_iron=20;
$market_land=150;
$market_time=108000;
$market_money=1000;
$market_kill=25;

//******************************************************************************
//стена*************************************************************************
$wall_arbor=80;
$wall_stone=80;
$wall_iron=40;
$wall_land=300;
$wall_time=162000;
$wall_kill=55;


include_once("func/game_func.php");
?>