<?

//==============================================================================
//подключаем скрипты

define('IN_CLV',true);
include_once("func/functions_clv.php");

//шапка:
include_once("other_inc/header.php");

printrus ("<u>Сайты, посвященные игре</u><br/>---<br/>\r\n");
printrus ("К материалам и статьям, расположенным на сайтах, администрация игры не имеет никакого отношения.
Мнение администрации может отличаться от мнения создателей сайтов. За дезинформацию администрация
ответственности не несет.<br/>\r\n");
printrus("<a href=\"http://ligatenei.wen.ru/\">клан Лига Теней</a><br/>\n");
printrus("<a href=\"http://rs-clan.wen.ru/\">клан Рыцари Справедливости</a><br/>\n");
//ботинки:
include_once("other_inc/footer.php");

?>
