<?php
//Параметры юнитов
$units=array();
//пехотинец
$u0=array(
"dmg"=>3,      //урон
"life"=>3,     //жизнь
"koef"=>array(2,1.7,0.7,0.5,0.7,0.1,0.4,1), //Коэффициенты эффективности против всех типов войск
//(пехота, кавалерист, стрелок, пушка, подрывник, самолет, маг соотв.)
"cost"=>array(7,2,0,0,5,0) //Стоимость обучения (деньги, железо, камень, лес, зерно, нефть)
);
array_push($units,$u0);
//кавалерист
$u1=array(
"dmg"=>10,
"life"=>10,
"koef"=>array(0.8,1,1.3,0.5,1,0.1,1.1,1),
"cost"=>array(12,3,4,3,15,0)
);
array_push($units,$u1);
//снайпер
$u2=array(
"life"=>12,
"dmg"=>18,
"koef"=>array(1.3,1,1,0.4,1.1,1.6,1.2,1),
"cost"=>array(15,5,7,5,20,0)
);
array_push($units,$u2);
//пушка
$u3=array(
"life"=>20,
"dmg"=>15,
"koef"=>array(2,2,2,1,0.5,0.5,1.2,1),
"cost"=>array(30,9,13,10,5,5)
);
array_push($units,$u3);
//подрывник
$u4=array(
"life"=>15,
"dmg"=>10,
"koef"=>array(0.8,0.8,0.8,3,1,0.1,0.8,1),
"cost"=>array(20,7,7,7,7,1)
);
array_push($units,$u4);
//самолет
$u5=array(
"life"=>20,
"dmg"=>25,
"koef"=>array(2.8,2.8,2.5,0.9,2.3,1,1.4,1),
"cost"=>array(40,10,13,10,5,10)
);
array_push($units,$u5);
//маг
$u6=array(
"life"=>35,
"dmg"=>28,
"koef"=>array(2.5,2.5,2.5,0.01,2.5,0.01,1,1),
"cost"=>array(60,13,15,12,25,5)
);

if ($teh_volshba_att==1)
$u6=array(
"life"=>35,
"dmg"=>28,
"koef"=>array(2.5,2.5,2.5,1,2.5,1,1,1),
"cost"=>array(60,13,15,12,25,5)
);

array_push($units,$u6);
//генераллисимус
//уничтожает генерала противника, если присутствует в битве, процент успеха в зависимости
//от охраны генерала
$u7=array(
"life"=>1,
"dmg"=>1,
"koef"=>array(0.01,0.01,0.01,0.01,0.01,0.01,0.01,0.01),
"cost"=>array(30000,5000,5000,5000,5000,1500)
);
array_push($units,$u7);







//Параметры юнитов 2
$units2=array();
//пехотинец
$u0=array(
"dmg"=>3,      //урон
"life"=>3,     //жизнь
"koef"=>array(1,1.7,0.7,0.5,0.7,0.1,0.4,1), //Коэффициенты эффективности против всех типов войск
//(пехота, кавалерист, стрелок, пушка, подрывник, самолет, маг соотв.)
"cost"=>array(7,2,0,0,5,0) //Стоимость обучения (деньги, железо, камень, лес, зерно, нефть)
);
array_push($units2,$u0);
//кавалерист
$u1=array(
"dmg"=>10,
"life"=>10,
"koef"=>array(0.8,1,1.3,0.5,1,0.1,1.1,1),
"cost"=>array(12,3,4,3,15,0)
);
array_push($units2,$u1);
//снайпер
$u2=array(
"life"=>12,
"dmg"=>18,
"koef"=>array(1.3,1,1,0.4,1.1,1.6,1.2,1),
"cost"=>array(15,5,7,5,20,0)
);
array_push($units2,$u2);
//пушка
$u3=array(
"life"=>20,
"dmg"=>15,
"koef"=>array(2,2,2,1,0.5,0.5,1.2,1),
"cost"=>array(30,9,13,10,5,5)
);
array_push($units2,$u3);
//подрывник
$u4=array(
"life"=>15,
"dmg"=>10,
"koef"=>array(0.8,0.8,0.8,3,1,0.1,0.8,1),
"cost"=>array(20,7,7,7,7,1)
);
array_push($units2,$u4);
//самолет
$u5=array(
"life"=>20,
"dmg"=>25,
"koef"=>array(2.8,2.8,2.5,0.9,2.3,1,1.4,1),
"cost"=>array(40,10,13,10,5,10)
);
array_push($units2,$u5);
//маг
$u6=array(
"life"=>35,
"dmg"=>28,
"koef"=>array(2.5,2.5,2.5,0.01,2.5,0.01,1,1),
"cost"=>array(60,13,15,12,25,5)
);

if ($teh_volshba_def==1)
$u6=array(
"life"=>35,
"dmg"=>28,
"koef"=>array(2.5,2.5,2.5,1,2.5,1,1,1),
"cost"=>array(60,13,15,12,25,5)
);

array_push($units2,$u6);
//генераллисимус
//уничтожает генерала противника, если присутствует в битве, процент успеха в зависимости
//от охраны генерала
$u7=array(
"life"=>1,
"dmg"=>1,
"koef"=>array(0.01,0.01,0.01,0.01,0.01,0.01,0.01,0.01),
"cost"=>array(30000,5000,5000,5000,5000,1500)
);
array_push($units2,$u7);








?>